Revit 2027 API
IndexLine Constructor
 Constructs the line segment primitive.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IndexLine(
	int index0,
	int index1
)
Public Sub New (
	index0 As Integer,
	index1 As Integer
)
public:
IndexLine(
	int index0,
	int index1
)
new :
        index0 : int *
        index1 : int -> IndexLine
Parameters
index0 Int32
 The index of the line segment's first vertex.
index1 Int32
 The index of the line segment's second vertex.
See Also
Reference
IndexLine Class
Autodesk.Revit.DB.DirectContext3D Namespace